src/Catalogs/КлассификаторЕдиницИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КлассификаторЕдиницИзмерения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународноеСокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/КлассификаторЕдиницИзмерения/Forms/ФормаПодбораИзКлассификатора/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция возвращает ссылку классификатора единиц измерения по числовому коду.
//
Функция НайтиПоКодуКлассификаторЕдиницИзмерения(КодЧисловой)
	
	 Возврат Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(КодЧисловой);
	
КонецФункции // НайтиПоКодуКлассификаторЕдиницИзмерения()	

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик события ПриСозданииНаСервере формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Макет = Справочники.КлассификаторЕдиницИзмерения.ПолучитьМакет("КлассификаторЕдиницИзмерения");
	
	Макет.Параметры.Расшифровка = Истина; // чтобы работала расшифровка
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(Макет);
	
	// Пользователю не показываем весовая это или нет единица измерения.
	ТабличныйДокумент.Области.ВесоваяЕдиница.Очистить();

	ТабличныйДокумент.ФиксацияСверху      = ТабличныйДокумент.Области.ОбластьРасшифровки.Верх - 1;

	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку     = Ложь;
	ТабличныйДокумент.ТолькоПросмотр      = Истина;

КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Обработчик события ОбработкаРасшифровки элемента ПолеТабличногоДокумента.
//
Процедура ПолеТабличногоДокументаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	// Получение значений полей выбранной строки.
	ТекущаяОбласть = Элементы.ТабличныйДокумент.ТекущаяОбласть;
	
	ОбластьКодЧисловой             = ТабличныйДокумент.Области.КодЧисловой;
	ОбластьНаименованиеКраткое     = ТабличныйДокумент.Области.НаименованиеКраткое;
	ОбластьНаименованиеПолное      = ТабличныйДокумент.Области.НаименованиеПолное;
	ОбластьМеждународноеСокращение = ТабличныйДокумент.Области.МеждународноеСокращение;
	
	КодЧисловой             = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьКодЧисловой.            Лево, ТекущаяОбласть.Низ, ОбластьКодЧисловой.Право).Текст;
	НаименованиеКраткое     = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеКраткое.    Лево, ТекущаяОбласть.Низ, ОбластьНаименованиеКраткое.Право).Текст;
	НаименованиеПолное      = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеПолное.     Лево, ТекущаяОбласть.Низ, ОбластьНаименованиеПолное.Право).Текст;
	МеждународноеСокращение = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьМеждународноеСокращение.Лево, ТекущаяОбласть.Низ, ОбластьМеждународноеСокращение.Право).Текст;
	
	// Проверка наличия выбранной единицы измерения.
	Ссылка = НайтиПоКодуКлассификаторЕдиницИзмерения(КодЧисловой);
			
	Если НЕ Ссылка.Пустая() Тогда
		
		Вопрос = НСтр("ru = 'В справочнике ""Классификатор единиц измерения"" уже существует элемент с кодом """ + КодЧисловой + """! Открыть существующий?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ПолеТабличногоДокументаОбработкаРасшифровкиЗавершение", ЭтотОбъект, Новый Структура("КодЧисловой, МеждународноеСокращение, НаименованиеКраткое, НаименованиеПолное, Ссылка", КодЧисловой, МеждународноеСокращение, НаименованиеКраткое, НаименованиеПолное, Ссылка)), Вопрос, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет,);
        Возврат;
		
	КонецЕсли;
		
	// Создание новой единицы измерения.
	ПолеТабличногоДокументаОбработкаРасшифровкиФрагмент(КодЧисловой, МеждународноеСокращение, НаименованиеКраткое, НаименованиеПолное);

КонецПроцедуры

&НаКлиенте
// Процедура - Поле табличного документа обработка расшифровки завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПолеТабличногоДокументаОбработкаРасшифровкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	КодЧисловой = ДополнительныеПараметры.КодЧисловой;
	МеждународноеСокращение = ДополнительныеПараметры.МеждународноеСокращение;
	НаименованиеКраткое = ДополнительныеПараметры.НаименованиеКраткое;
	НаименованиеПолное = ДополнительныеПараметры.НаименованиеПолное;
	Ссылка = ДополнительныеПараметры.Ссылка;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ПараметрыОткрытия = Новый Структура("Ключ", Ссылка);
		ОткрытьФорму("Справочник.КлассификаторЕдиницИзмерения.Форма.ФормаЭлемента", ПараметрыОткрытия);
		Возврат;
		
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
		
	КонецЕсли;
	
	
	ПолеТабличногоДокументаОбработкаРасшифровкиФрагмент(КодЧисловой, МеждународноеСокращение, НаименованиеКраткое, НаименованиеПолное);

КонецПроцедуры

&НаКлиенте
// Процедура - Поле табличного документа обработка расшифровки фрагмент
//
// Параметры:
//  КодЧисловой				 - 	 - 
//  МеждународноеСокращение	 - 	 - 
//  НаименованиеКраткое		 - 	 - 
//  НаименованиеПолное		 - 	 - 
//
Процедура ПолеТабличногоДокументаОбработкаРасшифровкиФрагмент(Знач КодЧисловой, Знач МеждународноеСокращение, Знач НаименованиеКраткое, Знач НаименованиеПолное)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Код", КодЧисловой);
	ПараметрыОткрытия.Вставить("Наименование", СтрПолучитьСтроку(НаименованиеКраткое, 1));
	ПараметрыОткрытия.Вставить("МеждународноеСокращение", Лев(МеждународноеСокращение, 3));
	ПараметрыОткрытия.Вставить("НаименованиеПолное", СтрПолучитьСтроку(НаименованиеПолное, 1));
	
	ОткрытьФорму("Справочник.КлассификаторЕдиницИзмерения.Форма.ФормаЭлемента", ПараметрыОткрытия);

КонецПроцедуры // ПолеТабличногоДокументаОбработкаРасшифровки()

#КонецОбласти
